content/about.md
+++
title = "About"
author = ["Markus Pettersson"]
draft = false
creator = "Emacs 29.0.50 (Org mode 9.6 + ox-hugo)"
[menu.main]
  weight = 1002
  identifier = "about"
+++

## Me {#me}

Markus Pettersson, 23 y.o. **software engineering student** living in **Gothenburg**, **Sweden**.
Born and raised in Arvika, where I grew fond of computers and tinkering with electronics.
Because computers play games, and you could save a few _sek_ by building your own computer.
Very important for a child who likes to humble brag about graphics settings.

It was not really until last year of upper secondary school that I <abbr title=" Wrote my first line of code">encountered programming</abbr>.
Which is weird, since I always wanted to get into game dev but never bothered.
I guess it was because I did not know how, nor did anyone around me.


## Interests, motivation {#interests-motivation}

My interest lie in **programming languages** and **developer tools**.
Who doesn't like when computers do a lot of work for them?
If computers can not automate a certain process, they should atleast gently guide the user through the process.
That's why I respectfully appreciate projects like [Rust](https://www.rust-lang.org/), which build on a collective of knowledge from a truly **open community** to reshape what systems programming can look like.
Now that I think about it, I haven't heard the phrase "[Bending the Curve](https://www.youtube.com/watch?v=LazvK39Oc4U)" in a while.
Maybe Rust's ideas about safety has become more and more normalized since its 1.0 release.
What do I know.

To strengthen my knowledge about **functional programming**, **type theory**, **compilers** and all of that jazz I enrolled in the [Computer Science master at Chalmers](https://www.chalmers.se/en/education/programmes/masters-info/pages/computer-science-algorithms-languages-and-logic.aspx) in 2020, which I'm about to graduate from this year (hopefully).
It has been a great experience, with lots of interesting courses and lecturers/professors.
I would claim that it has greatly improved my in-depth knowledge on all of the aforementioned topics.
I certainly know how a compiler works, and I would even go so far as to say that I know what a <abbr title=" A monad is just a monoid in the category of endofunctors, also known as a 'burrito' among domain experts.">monad</abbr> is. I hope to use my skills to build something cool one day, I'll just have to figure out what.

The style of this site is heavily influenced by [Bear Blog ʕ•ᴥ•ʔ](https://bearblog.dev/) by [Herman Martinus](https://herman.bearblog.dev/).
